amurzeau/damc_stm32/src/stm32n6570-dk/Appli/Core/Src/model_benchmark.c
#include "model_benchmark.h"
#include <stdint.h>
#include <stddef.h>
#include <stdio.h>
#include <stm32n6xx_hal.h>
#include "model.h"
#include <stdlib.h>
#include <limits.h>

struct event_counter_desc
{
  uint16_t flag;
  const char *name;
};

struct event_counter_desc counters[] = {
  {ARM_PMU_SW_INCR, "Software update to the PMU_SWINC register, architecturally executed and condition code check pass"},
  {ARM_PMU_L1I_CACHE_REFILL, "L1 I-Cache refill"},
  {ARM_PMU_L1D_CACHE_REFILL, "L1 D-Cache refill"},
  {ARM_PMU_L1D_CACHE, "L1 D-Cache access"},
  {ARM_PMU_LD_RETIRED, "Memory-reading instruction architecturally executed and condition code check pass"},
  {ARM_PMU_ST_RETIRED, "Memory-writing instruction architecturally executed and condition code check pass"},
  {ARM_PMU_INST_RETIRED, "Instruction architecturally executed"},
  {ARM_PMU_EXC_TAKEN, "Exception entry"},
  {ARM_PMU_EXC_RETURN, "Exception return instruction architecturally executed and the condition code check pass"},
  {ARM_PMU_PC_WRITE_RETIRED, "Software change to the Program Counter (PC). Instruction is architecturally executed and condition code check pass"},
  {ARM_PMU_BR_IMMED_RETIRED, "Immediate branch architecturally executed"},
  {ARM_PMU_BR_RETURN_RETIRED, "Function return instruction architecturally executed and the condition code check pass"},
  {ARM_PMU_UNALIGNED_LDST_RETIRED, "Unaligned memory memory-reading or memory-writing instruction architecturally executed and condition code check pass"},
  {ARM_PMU_BR_MIS_PRED, "Mispredicted or not predicted branch speculatively executed"},
  {ARM_PMU_CPU_CYCLES, "Cycle"},
  {ARM_PMU_BR_PRED, "Predictable branch speculatively executed"},
  {ARM_PMU_MEM_ACCESS, "Data memory access"},
  {ARM_PMU_L1I_CACHE, "Level 1 instruction cache access"},
  {ARM_PMU_L1D_CACHE_WB, "Level 1 data cache write-back"},
  {ARM_PMU_L2D_CACHE, "Level 2 data cache access"},
  {ARM_PMU_L2D_CACHE_REFILL, "Level 2 data cache refill"},
  {ARM_PMU_L2D_CACHE_WB, "Level 2 data cache write-back"},
  {ARM_PMU_BUS_ACCESS, "Bus access"},
  {ARM_PMU_MEMORY_ERROR, "Local memory error"},
  {ARM_PMU_INST_SPEC, "Instruction speculatively executed"},
  {ARM_PMU_BUS_CYCLES, "Bus cycles"},
  {ARM_PMU_L1D_CACHE_ALLOCATE, "Level 1 data cache allocation without refill"},
  {ARM_PMU_L2D_CACHE_ALLOCATE, "Level 2 data cache allocation without refill"},
  {ARM_PMU_BR_RETIRED, "Branch instruction architecturally executed"},
  {ARM_PMU_BR_MIS_PRED_RETIRED, "Mispredicted branch instruction architecturally executed"},
  {ARM_PMU_STALL_FRONTEND, "No operation issued because of the frontend"},
  {ARM_PMU_STALL_BACKEND, "No operation issued because of the backend"},
  {ARM_PMU_L2I_CACHE, "Level 2 instruction cache access"},
  {ARM_PMU_L2I_CACHE_REFILL, "Level 2 instruction cache refill"},
  {ARM_PMU_L3D_CACHE_ALLOCATE, "Level 3 data cache allocation without refill"},
  {ARM_PMU_L3D_CACHE_REFILL, "Level 3 data cache refill"},
  {ARM_PMU_L3D_CACHE, "Level 3 data cache access"},
  {ARM_PMU_L3D_CACHE_WB, "Level 3 data cache write-back"},
  {ARM_PMU_LL_CACHE_RD, "Last level data cache read"},
  {ARM_PMU_LL_CACHE_MISS_RD, "Last level data cache read miss"},
  {ARM_PMU_L1D_CACHE_MISS_RD, "Level 1 data cache read miss"},
  {ARM_PMU_OP_COMPLETE, "Operation retired"},
  {ARM_PMU_OP_SPEC, "Operation speculatively executed"},
  {ARM_PMU_STALL, "Stall cycle for instruction or operation not sent for execution"},
  {ARM_PMU_STALL_OP_BACKEND, "Stall cycle for instruction or operation not sent for execution due to pipeline backend"},
  {ARM_PMU_STALL_OP_FRONTEND, "Stall cycle for instruction or operation not sent for execution due to pipeline frontend"},
  {ARM_PMU_STALL_OP, "Instruction or operation slots not occupied each cycle"},
  {ARM_PMU_L1D_CACHE_RD, "Level 1 data cache read"},
  {ARM_PMU_LE_RETIRED, "Loop end instruction executed"},
  {ARM_PMU_LE_SPEC, "Loop end instruction speculatively executed"},
  {ARM_PMU_BF_RETIRED, "Branch future instruction architecturally executed and condition code check pass"},
  {ARM_PMU_BF_SPEC, "Branch future instruction speculatively executed and condition code check pass"},
  {ARM_PMU_LE_CANCEL, "Loop end instruction not taken"},
  {ARM_PMU_BF_CANCEL, "Branch future instruction not taken"},
  {ARM_PMU_SE_CALL_S, "Call to secure function, resulting in Security state change"},
  {ARM_PMU_SE_CALL_NS, "Call to non-secure function, resulting in Security state change"},
  {ARM_PMU_DWT_CMPMATCH0, "DWT comparator 0 match"},
  {ARM_PMU_DWT_CMPMATCH1, "DWT comparator 1 match"},
  {ARM_PMU_DWT_CMPMATCH2, "DWT comparator 2 match"},
  {ARM_PMU_DWT_CMPMATCH3, "DWT comparator 3 match"},
  {ARM_PMU_MVE_INST_RETIRED, "MVE instruction architecturally executed"},
  {ARM_PMU_MVE_INST_SPEC, "MVE instruction speculatively executed"},
  {ARM_PMU_MVE_FP_RETIRED, "MVE floating-point instruction architecturally executed"},
  {ARM_PMU_MVE_FP_SPEC, "MVE floating-point instruction speculatively executed"},
  {ARM_PMU_MVE_FP_HP_RETIRED, "MVE half-precision floating-point instruction architecturally executed"},
  {ARM_PMU_MVE_FP_HP_SPEC, "MVE half-precision floating-point instruction speculatively executed"},
  {ARM_PMU_MVE_FP_SP_RETIRED, "MVE single-precision floating-point instruction architecturally executed"},
  {ARM_PMU_MVE_FP_SP_SPEC, "MVE single-precision floating-point instruction speculatively executed"},
  {ARM_PMU_MVE_FP_MAC_RETIRED, "MVE floating-point multiply or multiply-accumulate instruction architecturally executed"},
  {ARM_PMU_MVE_FP_MAC_SPEC, "MVE floating-point multiply or multiply-accumulate instruction speculatively executed"},
  {ARM_PMU_MVE_INT_RETIRED, "MVE integer instruction architecturally executed"},
  {ARM_PMU_MVE_INT_SPEC, "MVE integer instruction speculatively executed"},
  {ARM_PMU_MVE_INT_MAC_RETIRED, "MVE multiply or multiply-accumulate instruction architecturally executed"},
  {ARM_PMU_MVE_INT_MAC_SPEC, "MVE multiply or multiply-accumulate instruction speculatively executed"},
  {ARM_PMU_MVE_LDST_RETIRED, "MVE load or store instruction architecturally executed"},
  {ARM_PMU_MVE_LDST_SPEC, "MVE load or store instruction speculatively executed"},
  {ARM_PMU_MVE_LD_RETIRED, "MVE load instruction architecturally executed"},
  {ARM_PMU_MVE_LD_SPEC, "MVE load instruction speculatively executed"},
  {ARM_PMU_MVE_ST_RETIRED, "MVE store instruction architecturally executed"},
  {ARM_PMU_MVE_ST_SPEC, "MVE store instruction speculatively executed"},
  {ARM_PMU_MVE_LDST_CONTIG_RETIRED, "MVE contiguous load or store instruction architecturally executed"},
  {ARM_PMU_MVE_LDST_CONTIG_SPEC, "MVE contiguous load or store instruction speculatively executed"},
  {ARM_PMU_MVE_LD_CONTIG_RETIRED, "MVE contiguous load instruction architecturally executed"},
  {ARM_PMU_MVE_LD_CONTIG_SPEC, "MVE contiguous load instruction speculatively executed"},
  {ARM_PMU_MVE_ST_CONTIG_RETIRED, "MVE contiguous store instruction architecturally executed"},
  {ARM_PMU_MVE_ST_CONTIG_SPEC, "MVE contiguous store instruction speculatively executed"},
  {ARM_PMU_MVE_LDST_NONCONTIG_RETIRED, "MVE non-contiguous load or store instruction architecturally executed"},
  {ARM_PMU_MVE_LDST_NONCONTIG_SPEC, "MVE non-contiguous load or store instruction speculatively executed"},
  {ARM_PMU_MVE_LD_NONCONTIG_RETIRED, "MVE non-contiguous load instruction architecturally executed"},
  {ARM_PMU_MVE_LD_NONCONTIG_SPEC, "MVE non-contiguous load instruction speculatively executed"},
  {ARM_PMU_MVE_ST_NONCONTIG_RETIRED, "MVE non-contiguous store instruction architecturally executed"},
  {ARM_PMU_MVE_ST_NONCONTIG_SPEC, "MVE non-contiguous store instruction speculatively executed"},
  {ARM_PMU_MVE_LDST_MULTI_RETIRED, "MVE memory instruction targeting multiple registers architecturally executed"},
  {ARM_PMU_MVE_LDST_MULTI_SPEC, "MVE memory instruction targeting multiple registers speculatively executed"},
  {ARM_PMU_MVE_LD_MULTI_RETIRED, "MVE memory load instruction targeting multiple registers architecturally executed"},
  {ARM_PMU_MVE_LD_MULTI_SPEC, "MVE memory load instruction targeting multiple registers speculatively executed"},
  {ARM_PMU_MVE_ST_MULTI_RETIRED, "MVE memory store instruction targeting multiple registers architecturally executed"},
  {ARM_PMU_MVE_ST_MULTI_SPEC, "MVE memory store instruction targeting multiple registers speculatively executed"},
  {ARM_PMU_MVE_LDST_UNALIGNED_RETIRED, "MVE unaligned memory load or store instruction architecturally executed"},
  {ARM_PMU_MVE_LDST_UNALIGNED_SPEC, "MVE unaligned memory load or store instruction speculatively executed"},
  {ARM_PMU_MVE_LD_UNALIGNED_RETIRED, "MVE unaligned load instruction architecturally executed"},
  {ARM_PMU_MVE_LD_UNALIGNED_SPEC, "MVE unaligned load instruction speculatively executed"},
  {ARM_PMU_MVE_ST_UNALIGNED_RETIRED, "MVE unaligned store instruction architecturally executed"},
  {ARM_PMU_MVE_ST_UNALIGNED_SPEC, "MVE unaligned store instruction speculatively executed"},
  {ARM_PMU_MVE_LDST_UNALIGNED_NONCONTIG_RETIRED, "MVE unaligned noncontiguous load or store instruction architecturally executed"},
  {ARM_PMU_MVE_LDST_UNALIGNED_NONCONTIG_SPEC, "MVE unaligned noncontiguous load or store instruction speculatively executed"},
  {ARM_PMU_MVE_VREDUCE_RETIRED, "MVE vector reduction instruction architecturally executed"},
  {ARM_PMU_MVE_VREDUCE_SPEC, "MVE vector reduction instruction speculatively executed"},
  {ARM_PMU_MVE_VREDUCE_FP_RETIRED, "MVE floating-point vector reduction instruction architecturally executed"},
  {ARM_PMU_MVE_VREDUCE_FP_SPEC, "MVE floating-point vector reduction instruction speculatively executed"},
  {ARM_PMU_MVE_VREDUCE_INT_RETIRED, "MVE integer vector reduction instruction architecturally executed"},
  {ARM_PMU_MVE_VREDUCE_INT_SPEC, "MVE integer vector reduction instruction speculatively executed"},
  {ARM_PMU_MVE_PRED, "Cycles where one or more predicated beats architecturally executed"},
  {ARM_PMU_MVE_STALL, "Stall cycles caused by an MVE instruction"},
  {ARM_PMU_MVE_STALL_RESOURCE, "Stall cycles caused by an MVE instruction because of resource conflicts"},
  {ARM_PMU_MVE_STALL_RESOURCE_MEM, "Stall cycles caused by an MVE instruction because of memory resource conflicts"},
  {ARM_PMU_MVE_STALL_RESOURCE_FP, "Stall cycles caused by an MVE instruction because of floating-point resource conflicts"},
  {ARM_PMU_MVE_STALL_RESOURCE_INT, "Stall cycles caused by an MVE instruction because of integer resource conflicts"},
  {ARM_PMU_MVE_STALL_BREAK, "Stall cycles caused by an MVE chain break"},
  {ARM_PMU_MVE_STALL_DEPENDENCY, "Stall cycles caused by MVE register dependency"},
  {ARM_PMU_ITCM_ACCESS, "Instruction TCM access"},
  {ARM_PMU_DTCM_ACCESS, "Data TCM access"},
  {ARM_PMU_TRCEXTOUT0, "ETM external output 0"},
  {ARM_PMU_TRCEXTOUT1, "ETM external output 1"},
  {ARM_PMU_TRCEXTOUT2, "ETM external output 2"},
  {ARM_PMU_TRCEXTOUT3, "ETM external output 3"},
  {ARM_PMU_CTI_TRIGOUT4, "Cross-trigger Interface output trigger 4"},
  {ARM_PMU_CTI_TRIGOUT5, "Cross-trigger Interface output trigger 5"},
  {ARM_PMU_CTI_TRIGOUT6, "Cross-trigger Interface output trigger 6"},
  {ARM_PMU_CTI_TRIGOUT7, "Cross-trigger Interface output trigger 7"},
  {0xFFFF, "Total Cycles"},
};
const struct event_counter_desc *current_counter;
size_t counters_index;
size_t counters_step_index;
uint32_t counters_value[sizeof(counters) / sizeof(counters[0])][256];
const char *counters_name[256];

void save_counters(const char *name)
{
  return;
  ARM_PMU_CNTR_Disable(PMU_CNTENCLR_CCNTR_ENABLE_Msk | PMU_CNTENCLR_CNT0_ENABLE_Msk | PMU_CNTENSET_CNT1_ENABLE_Msk);
  __DMB();
  if (current_counter->flag != 0xFFFF)
  {
    counters_value[counters_index][counters_step_index] = ARM_PMU_Get_EVCNTR(0) | (ARM_PMU_Get_EVCNTR(1) << 16);
  }
  else
  {
    counters_value[counters_index][counters_step_index] = ARM_PMU_Get_CCNTR();
  }
  counters_step_index++;
  counters_name[counters_step_index] = name;
  ARM_PMU_EVCNTR_ALL_Reset();
  ARM_PMU_CYCCNT_Reset();
  __DMB();
  ARM_PMU_CNTR_Enable(PMU_CNTENCLR_CCNTR_ENABLE_Msk | PMU_CNTENCLR_CNT0_ENABLE_Msk | PMU_CNTENSET_CNT1_ENABLE_Msk);
}

static model_data_type_t tensor_feat_erb[1][1][1][32] __attribute__((section(".dtcm"))) __attribute__((aligned(16)));
static model_data_type_t tensor_feat_spec[1][2][1][96] __attribute__((section(".dtcm"))) __attribute__((aligned(16)));
static model_data_type_t tensor_e0[1][64][1][32] __attribute__((section(".dtcm"))) __attribute__((aligned(16)));
static model_data_type_t tensor_e1[1][64][1][16] __attribute__((section(".dtcm"))) __attribute__((aligned(16)));
static model_data_type_t tensor_e2[1][64][1][8] __attribute__((section(".dtcm"))) __attribute__((aligned(16)));
static model_data_type_t tensor_e3[1][64][1][8] __attribute__((section(".dtcm"))) __attribute__((aligned(16)));
static model_data_type_t tensor_emb[1][1][512] __attribute__((section(".dtcm"))) __attribute__((aligned(16)));
static model_data_type_t tensor_c0[1][64][1][96] __attribute__((section(".dtcm"))) __attribute__((aligned(16)));
static model_data_type_t tensor_lsnr[1][1][1] __attribute__((section(".dtcm"))) __attribute__((aligned(16)));

static model_data_type_t tensor_m[1][1][1][32] __attribute__((section(".dtcm"))) __attribute__((aligned(16)));

static model_data_type_t tensor_coefs[1][1][96][10] __attribute__((section(".dtcm"))) __attribute__((aligned(16)));
static model_data_type_t tensor_235[1][1][1] __attribute__((section(".dtcm"))) __attribute__((aligned(16)));

static void randomize(model_data_type_t *array, size_t size_bytes)
{
  size_t count = size_bytes / 2;
  for (size_t i = 0; i < count; i++)
  {
    array[i] = i / ((model_data_type_t)INT_MAX + 1);
  }
}

void model_benchmark()
{
  // Increase hardware prefetcher performance
  MEMSYSCTL->PFCR = 0b1101101101;

  /* Enable Trace */
  CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;

  /* Reset Cycle Counter and Event Counters */
  ARM_PMU_CYCCNT_Reset();

  /* Enable Cycle Counter */
  ARM_PMU_CNTR_Enable(PMU_CNTENSET_CCNTR_ENABLE_Msk);

  /* Enable the PMU */
  ARM_PMU_Enable();

  HAL_SuspendTick();

  randomize((model_data_type_t *)tensor_feat_erb, sizeof(tensor_feat_erb));
  randomize((model_data_type_t *)tensor_feat_spec, sizeof(tensor_feat_spec));
  randomize((model_data_type_t *)tensor_e0, sizeof(tensor_e0));
  randomize((model_data_type_t *)tensor_e1, sizeof(tensor_e1));
  randomize((model_data_type_t *)tensor_e2, sizeof(tensor_e2));
  randomize((model_data_type_t *)tensor_e3, sizeof(tensor_e3));
  randomize((model_data_type_t *)tensor_emb, sizeof(tensor_emb));
  randomize((model_data_type_t *)tensor_c0, sizeof(tensor_c0));
  randomize((model_data_type_t *)tensor_lsnr, sizeof(tensor_lsnr));
  randomize((model_data_type_t *)tensor_m, sizeof(tensor_m));
  randomize((model_data_type_t *)tensor_coefs, sizeof(tensor_coefs));
  randomize((model_data_type_t *)tensor_235, sizeof(tensor_235));


  for (counters_index = 0; counters_index < sizeof(counters) / sizeof(counters[0]); counters_index++)
  {
    current_counter = &counters[counters_index];
    ARM_PMU_EVCNTR_ALL_Reset();
    ARM_PMU_CYCCNT_Reset();
    if (current_counter->flag != 0xFFFF)
    {
      ARM_PMU_Set_EVTYPER(0, current_counter->flag);
      ARM_PMU_Set_EVTYPER(1, ARM_PMU_CHAIN);
    }
    SCB_CleanInvalidateDCache();
    counters_step_index = 0;
    counters_name[counters_step_index] = "Start";
    __DMB();
    ARM_PMU_CNTR_Enable(PMU_CNTENCLR_CCNTR_ENABLE_Msk | PMU_CNTENCLR_CNT0_ENABLE_Msk | PMU_CNTENSET_CNT1_ENABLE_Msk);

    deepfilternet_run_enc(tensor_feat_erb, tensor_feat_spec, tensor_e0, tensor_e1, tensor_e2, tensor_e3, tensor_emb, tensor_c0, tensor_lsnr);
    deepfilternet_run_erb_dec(tensor_emb, tensor_e3, tensor_e2, tensor_e1, tensor_e0, tensor_m);
    deepfilternet_run_df_dec(tensor_emb, tensor_c0, tensor_coefs, tensor_235);

    ARM_PMU_CNTR_Disable(PMU_CNTENCLR_CCNTR_ENABLE_Msk | PMU_CNTENCLR_CNT0_ENABLE_Msk | PMU_CNTENSET_CNT1_ENABLE_Msk);
    if (current_counter->flag != 0xFFFF)
    {
      counters_value[counters_index][counters_step_index] = ARM_PMU_Get_EVCNTR(0) | (ARM_PMU_Get_EVCNTR(1) << 16);
    }
    else
    {
      counters_value[counters_index][counters_step_index] = ARM_PMU_Get_CCNTR();
    }
    counters_step_index++;
  }

  printf("PMU;");
  for (size_t j = 0; j < counters_step_index; j++)
  {
    if (counters_name[j])
      printf("%s;", counters_name[j]);
    else
      printf(";");
  }
  printf("\n");
  for (size_t i = 0; i < sizeof(counters) / sizeof(counters[0]); i++)
  {
    const struct event_counter_desc *const event_counter = &counters[i];
    printf("%s;", event_counter->name);
    for (size_t j = 0; j < counters_step_index; j++)
    {
      printf("%lu;", counters_value[i][j]);
    }
    printf("\n");
  }
  printf("\n");


  HAL_ResumeTick();
}
